# Getting started with pandas

Pandas는?
- 앞으로 가장 살펴볼 라이브러리
- 고수준의 자료구조와 파이썬을 통한 빠르고 쉬운 데이터 분석 도구를 포함
- 자동적 혹은 명시적으로 축의 이름에 따라 데이터를 정렬할 수 있는 자료 구조.
- 통합된 시계열 기능
- 시계열 데이터 + 비시계열 데이터를 다룰 수 있는 통합 자료 구조
- 누락된 데이터를 유연하게 처리할 수 있는 기능
- SQL 같은 일반 DB처럼 데이터를 합치고 관계연산을 수행하는 기능

In [252]:
from pandas import Series, DataFrame
import pandas as pd

## pandas의 Series와 DataFrame 이 두가지 자료 구조에 익숙해질 필요가 있다.
#### 이 자료구조 모든 문제를 해결 할 수는 없지만 대부분의 어플리케이션에서 사용하기 쉽고 탄탄한 기반을 제공한다

In [253]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt #안배움
np.random.seed(12345) #seed설정
plt.rc('figure', figsize=(10, 6)) #안배움
from pandas import Series, DataFrame #Pandas 주요 자료구조 import
import pandas as pd #Pandas를 import하고 pd라고 하겠다.

## Introduction to pandas data structures

# Series

- 일련의 객체를 담을 수 있는 1차원 배열같은 자료구조.(어떤 numpy 자료형이라도 담을 수있음)
- index라고하는 배열의 데이터에 연관된 이름을 가지고 있다.
- **다른말로 고정 길이의 정렬된 사전형

In [22]:
obj = Series([4, 7, -5, 3]) #배열 데이터로부터 Series 생성
obj #왼쪽  index, 오른쪽에 해당 색인의 값 보여준다.

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
print("obj.values = " , obj.values) #값 출력
print("obj.index = ", obj.index) # index 출력

obj.values =  [ 4  7 -5  3]
obj.index =  RangeIndex(start=0, stop=4, step=1)

In [24]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) #index 지정 가능
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [25]:
obj2.index #따로 지정한 index 확인

Index(['d', 'b', 'a', 'c'], dtype='object')

#### 배열에서 값을 선택하거나 대입할 때는 '색인'을 이용해서 접근

In [26]:
print(obj2['a'])
obj2['d'] = 6
obj2[['c', 'a', 'd']]

-5

c    3
a   -5
d    6
dtype: int64

#### 불리언 배열을 사용해 값을 걸러내거나 산술 곱셈을 수행하거나 수학 함수를 적용 가능

In [27]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [28]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [29]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [30]:
'b' in obj2

True

In [31]:
'e' in obj2

False

In [32]:
#사전형에 데이터를 저장해야 한다면, 파이썬 사전 객체로부터 Series 객체를 생성할 수 있음
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3 #key 값을 index로 , value값을 데이터값으로

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [33]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states) 
             
obj4 # sdata에 있는 값 중 3개만 확인 할 수 있음..

#지정해주는 index에 따라 원래 data가 짤리기도 없어지기도 하나..?
# 그럼 원래data도 보고싶다면..?

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

#### isnull과 notnull은 누락된 데이터를 찾을 때 사용됨

###### NaN = Not a number , NA = 누락된 값??

# 무슨차이

In [34]:
pd.isnull(obj4) #null인지?

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
pd.notnull(obj4) # null이 아닌지?

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
pd.notNaN(obj4) #이건 왜 없어?

AttributeError: module 'pandas' has no attribute 'notNaN'

In [37]:
obj4.isnull() #이런식으로도 호출가능
#나는 이런식이 더 좋음( Series의 인스턴스 메소드를 부르는 형식)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [38]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj3 + obj4 #JOIN + 산술계산...

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [41]:
obj3 * obj4

California             NaN
Ohio          1.225000e+09
Oregon        2.560000e+08
Texas         5.041000e+09
Utah                   NaN
dtype: float64

##### ↑누락된 데이터를 처리하는 방법과 데이터 정렬에 대한 내용은 뒤에서 다시 공부하고 넘어가자

In [42]:
####################################################################33

### Series 객체와 Series의 색인은 모두 name속성이 있는데
## pandas의 기능중에서 중요한 부분을 차지하고있다.

In [43]:
obj4.name = 'population' # Series의 이름
obj4.index.name = 'state' #index의 이름
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [44]:
obj #원래 obj 내용 확인

0    4
1    7
2   -5
3    3
dtype: int64

In [45]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan'] #순서대로 index에 들어간다
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [46]:
#연습
obj.index.name = "Name"
obj.name = "Members"
obj

Name
Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: Members, dtype: int64

# DataFrame
- 표 같은 스프레드시트 형식의 자료구조로 여러 개의 칼럼이 있는데 각 칼럼은 서로 다른 종류의 값을 담을 수 있다.(엑셀 처럼?)
- DataFrame을 인덱스가 같은 여러 개의 Series 객체로 구성된 자료구조
- R의 data.frame 같은 다른 DataFrame과 비슷한 자료구조아 비교했을 때 로우 연산과 칼럼 연산은 거의 대칭적으로 취급된다.???????????무슨뜻??

![13.10]https://wikidocs.net/images/page/4367/r13.10.png
- **입력 데이터와의 구조적 유사성(2차원) 관점에서 바라보면 DataFrame이 그림 13.10과 같이 구성된다**




![13.11]https://wikidocs.net/images/page/4367/r13.11.png
-  **DataFrame의 각 칼럼에 대한 접근 방식 관점에서 바라보면 DataFrame이 그림 13.11과 같이 구성된다**

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [48]:
frame # Series와 같은 방식으로 자동으로 대입되며 칼럼은 정렬되어 저장됨.

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [49]:
DataFrame(data, columns=['year', 'state', 'pop']) #원하는 순서대로 칼럼 지정 가능

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [50]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], # columns 지정
                   index=['one', 'two', 'three', 'four', 'five']) #index 지정
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
print(frame2['state'])
print()
print(frame2.state) #컬럼명으로 접근

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [53]:
frame2.ix['three'] #index로 접근

#반환된 Series 객체가 DataFrame 같은 색인을 가지면 알맞은 값으로 name속성이 채워진다.
#row(행)은 위치나 ix 같은 몇 가지 메서드를 통해 접근 가능

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [54]:
frame2['three'] #안됨..
frame2.three

KeyError: 'three'

In [55]:
frame2['debt'] = 16.5 #비어 있는 debt 칼럼에 스칼라 값이나 배열의 값을 대입 가능
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [56]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

### 리스트나 배열을 칼럼에 대입할 때는 값의 길이가 DataFrame의 크기와 같아야한다.

In [57]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [58]:
frame2['eastern'] = (frame2.state == 'Ohio') #T/F 값으로 대입가능
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [59]:
del frame2['eastern'] #삭제
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [60]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [61]:
frame3 = DataFrame(pop)
frame3#없는 값은 NAN으로 나옴

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [62]:
frame3.T #transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [63]:
DataFrame(pop, index=[2001, 2002, 2003]) #2003이라는 index추가

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [64]:
frame3

frame3.Ohio

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [65]:
frame3['Ohio'][:-1]
frame3.Ohio[:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [66]:
frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [67]:
pdata = {'Ohio': frame3['Ohio'][:-1], #frame3의 ohio칼럼의 처음부터 마지막1번째(위에 결과물 출력)
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [68]:
frame3.index.name = 'year'; frame3.columns.name = 'state' 
frame3#dataframe name설정해주면 이런식으로 들어간다.

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [69]:
frame3.values #Series와 유사하게 values 속성은 DataFrame에 저장된 데이터를 2차원 배열로 반환함

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [70]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [71]:
frame2.values # 서로다른 타입이라면 모든 칼럼을 수용하기 위해 그 칼럼 배열의 dtype이 선택
##무슨말일까???????????????
Q#여기서 object라는 것은 series를 뜻하는것인가?

NameError: name 'Q' is not defined

### Index objects
- pandas의 index 객체는 표 형식의 데이터에서 각 로우와 칼럼에 대한 이름과 다른 메타데이터(축의 이름 등)을 저장하는 객체다.
- Series나 dataFrame 객체를 생성할 때 사용되는 배열이나 혹은 다른 순차적인 이름은 내부적으로 색인으로 변환된다..?????????????????????????

In [72]:
obj = Series(range(3), index=['a', 'b', 'c']) #Series객체 생성
print(obj)
index= obj.index
index

a    0
b    1
c    2
dtype: int32

Index(['a', 'b', 'c'], dtype='object')

In [73]:
index[1:] #1부터 끝까지

Index(['b', 'c'], dtype='object')

In [74]:
index[1] = 'd' #index 객체는 변경할 수 없다.

TypeError: Index does not support mutable operations

## Q.  하나의 값만 변경할 수 없다는 건가...?

In [75]:
obj.index = ['d','e','f'] #index전부를 변경할 수는 있다.
#그럼 여기서 index객체의 의미는..?
print(obj.index)
obj

Index(['d', 'e', 'f'], dtype='object')

d    0
e    1
f    2
dtype: int32

### index객체는 변경할 수 없기에 자료 구조 사이에서 안전하게 공유될 수 있다.
- pandas에서 사용되는 내장 색인 클래스가 정의되어 있다.
- 특수한 목적으로 축을 색인하는 기능을 개발하기 위해 Index 클래스의 서브클래스를 만들 수 있다.

In [76]:
import numpy as np
index = pd.Index(np.arange(3))
print(index)
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

Int64Index([0, 1, 2], dtype='int64')

True

## 또한 배열과 유사하게 Index 객체도 고정 크기로 동작한다.

# ???무슨소리

In [77]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [78]:
'Ohio' in frame3.columns # Ohio가 frame3의 컬럼에 있는가?

True

In [79]:
2003 in frame3.index # 2003이 index에 있는가

False

## Essential functionality
- 앞으로 pandas를 이용한 데이터 분석과 조작에 관한 좀더 자세한 내용을 살펴보자
- 중요한 기능에만 초점을 맞추고 있다.

### Reindexing(재색인)
- 새로운 색인에 맞도록 객체를 새로 생성하는 기능

In [80]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [81]:
#이 Series 객체에 대해 reindex를 호출하면 데이터를 새로운 색인에 맞게 재배열하고, 
#없는 색인 값이 있다면 비어있는 값을 새로 추가한다.
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [82]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #없는 색인 값이 있으면(fill_value) 값으로 대체해라

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

### 시계열 같은 순차적인 데이터를 재색인 할 때 값을 보간하거나 채워 넣어야 할 경우가 있다. 
### 이런경우 method 옵션을 이용해 해결가능하다.
- ffill or pad : 앞의 값으로 누럭된 값을 채워 넣는다.
- bfill or backfill : 뒤의 값으로 채워 넣는다.

In [83]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [84]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

DataFrame에 대한 reindex는 로우 색인, 칼럼 또는 둘 다 변경이 가능하다. 순서(?)만 전달하면 로우가 재색인된다.

In [85]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

열은 columns라는 예약어를 사용해서 reindex가능하다.

In [86]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

row(행)과 column(열) 모두 한 번에 재색인 할 수 있지만 보간(채워넣는거)은 row에 대해서만 이루어진다(axis 0)?

In [87]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)
#보면 새로추가된 b(row)에 대해 ffill이 적용되었고, 새로 추가된 Utah(col)는 NaN으로 처리되었다.

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [88]:
frame.ix[['a', 'b', 'c', 'd'], states]#이렇게도 가능

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

재색인 함수 인자는 교재 p175의 5-5참고하자

### Dropping entries from an axis
- 색인 배열 또느 삭제하려는 로우나 칼럼이 제외된 리스트를 이미 가지고 있다면 로우나 칼럼을 쉽게 삭제할 수 있는데 이 방법은 데이터의 모양을 변경하는 작업이 필요하다(원래 data를 변경해야된다는 말 같다)
- drop 메소드를 사용하면 선택한 값이 삭제된 새로운 객체를 얻을 수 있다.

In [89]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c') #c가 삭제된 새로운 객체를 얻었다.
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj.drop(['d', 'c']) #2개도 삭제가능

a    0.0
b    1.0
e    4.0
dtype: float64

### DataFrame에서는 로우와 칼럼 모두에서 값을 삭제할 수 있다.

In [91]:
#하나의 dataFrame을 만들고
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [92]:
#Colorado라는 index와 Ohio라는 index 삭제
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop.html?highlight=drop#pandas.DataFrame.drop

In [93]:
data.drop('one',axis=1)
data.drop('two', 1) #이렇게도 가능
#axis=1은  컬럼을 의미. axis=0은 행을 의미

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [94]:
data.drop(['two', 'four'], axis=1) # 2개도 삭제 가능
#복습) axis=1 이니까 열 삭제

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 즉, axis의 default값은 0 이다. 그래서 아까 위에서 row(행)을 지울땐 안써줘도 실행되었던 것

---

### Indexing, selection, and filtering(색인하기, 선택하기, filtering)

- Series의 색인(obj[...])은 Numpy 배열의 색인과 유사하게 동작하는데, Series의 색인은 정수가 아니어도 된다는 점이 다르다.(아까 다 한 얘기)

In [95]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [96]:
obj['b'] #index b의 값은?

1.0

In [97]:
obj[1] #index 두번째의 값은?

1.0

### 라벨 이름으로 슬라이싱 하는 것은 시작점과 끝점을 포함한다 (일반 파이썬의 슬라이싱과의 다른점!)

In [98]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [99]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [100]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [101]:
obj[obj < 2] # 값이 2 이하인 것들만 추출

a    0.0
b    1.0
dtype: float64

In [102]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [103]:
obj['b':'c'] = 5 
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

---

In [104]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

색인으로 DataFrmae에서 칼럼의 값을 하나 이상 가져올 수 있다.

In [105]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [106]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [107]:
data[:2] #슬라이싱으로 로우 선택

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [108]:
data[data['three'] > 5] #불리언 배열로 칼럼 선택

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
#실용성에 기인한 문법이므로 그냥 그렇다고 생각하래
    
data < 5
#스칼라 비교를 통해 생성된 불리언 DataFrame을 사요해서 값을 선택하는 방법

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [110]:
data[data < 5] = 0 #위에서 True에 대해 0을 삽입

In [111]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.ix['Colorado',['two','three']] #Colorado 행의 two, three열만 가져오겠다

two      5
three    6
Name: Colorado, dtype: int32

In [113]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [114]:
data.ix[2] # 그냥 이렇게 쓰면 3번째 행만 가져옴

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [115]:
data.ix[:'Utah', 'two'] # 처음부터 Utah까지 'two' 열만 가져옴

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [116]:
print(data)
data.ix[data.three > 5, :3]
# 행: data.three가 5초과인거
# 열: 처음부터3(포함)까지

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

P180 표5-6 DataFrame의 값 선택하기 참고

- obj.ix[val]         : DataFrame에서 row(행)의 부분집합을 선택한다.
- obj.ix[:,val]       : DataFrame에서 col(열)의 부분집합을 선택한다.
- obj.ix[val1, val2]  : DataFrame에서 row와 col의 부분집합을 선택한다.

### Arithmetic and data alignment

##### pandas에서 중요한 기능은 색인이 다른 객체 간의 산술연산이다. 객체를 더할 때 짝이 않는 색인이 있다면 결과에 두 색인이 통합된다.

In [117]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g']) #색인이 다른 두 Series 객체

In [118]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [119]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [120]:
s1 + s2 #서로 겹치는 색인이 없다면 데이터는 NA값이 된다.
#산술 연산시 누락된 값은 전파되며, DataFrame에서는 로우와 칼럼 모두에 적용된다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [121]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [122]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [123]:
df1 + df2 #각 dp에 있는 색인과 칼럼이 하나로 합쳐진다
#기존데이터에 값이 있어도 합쳐지는 dp에 없으면 NaN으로 표현됨.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values
- 서로 다른 색인을 가지는 객체 간의 산술연산에서 존재하지 않는 축의 값을 특수한 값(0같은)으로 지정하고 싶을 때는 다음과 같이 할 수 있다.

In [124]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd')) #list로도 줘도 인식하는구나..
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
# df3 = DataFrame(np.arange(15.).reshape((3,5)), columns = list('kjoiu'))(연습)
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [125]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [126]:
df1 + df2 # df2가 1행 1열씩 더 많으므로 NaN으로 채워지는 것을 볼 수있다.

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [127]:
df1.add(df2, fill_value=0) #df1의add메서드로 df2와 fill_value값을 인자로 전달한다
#보면 df2의 값들이 그대로 들어온것을 알 수 있다.

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [128]:
df1.reindex(columns=df2.columns, fill_value=0) #reindex할때 역시 fill_value를 지정할 수 있다.
#이건 왜 df2.column의 값들이 안들어오지?? 재배열이라그런가??

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series
- DataFrame과 Series간의 연산
- 먼저 2차원 배열과 그 배열 중 한 칼럼의 차이에 대해서 생각할 수 있는 예제를 살펴보자

In [129]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [130]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [131]:
#12장의 Broadcasting에 대한 예제
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [132]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [133]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

#### 기본적으로 DataFrame과 Series간의 산술연산은 Series의 색인을 DataFrmae의 칼럼에 맞추고 아래 로우로 전파한다.
- 만약 색인 값을 DataFrmae의 칼럼이나 Series의 색인에서 찾을 수 없다면, 그 객체는 형식을 맞추기 위해 재색인된다.

In [134]:
frame - series #위에서 봤던 Numpy와 같다.

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [135]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [136]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [137]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [138]:
frame.sub(series3, axis=0) # 그냥 + 가 아니라 sub메서드를 통해 연산하면 없는 열은 0으로 표현되네

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping
- pandas 객체에도 Numpy의 유니버셜 함수(배열의 각 원소에 적용되는 메서드)를 적용할 수 있다.

In [139]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [140]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [141]:
np.abs(frame) #절대값

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [142]:
f = lambda x: x.max() - x.min() #람다함수 만들고

In [143]:
frame.apply(f) #열로 적용

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [144]:
frame.apply(f, axis=1) # 행적용

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

배열의 합계나 평균 같은 일반적인 통계는 DataFrmae의 메서드로 있으므로 aaply메서드를 사용해야만 하는 것은 아니다.

apply메서드에 전달된 함수는 스칼라 값을 반환할 필요가 없으며 Seiries또는 여러 값을 반환해도 된다.

In [145]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f) #함수를 전달할 수도있다 #어떻게 그려지는이 그림이 이해가 안됨.....(??????)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [146]:
format = lambda x: '%.2f' % x #실수값을 문자열 포맷(소수점2번째까지 표현)으로 변환하고 싶다
frame.applymap(format)
#이 메서드의 이름이 aaplymap인 이유는 SEries가 각 원소에 적용할 함수를 지정하기 위한 map 메서드를 가지고 있기 때문이다

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [147]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking
- 어떤 기준에 근거하여 데이터를 정렬하는 것 역시 중요한 명령이다. 로우나 칼럼의 색인을 알파벳 순으로 정렬하려면 정렬된 새로운 객체를 반환하는 sort_index 메서드를 사용하면 된다

In [148]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [149]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index() #행, 열 둘다 정렬 해줌

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [150]:
frame.sort_index(axis=1)  #열만 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [151]:
frame.sort_index(axis=1, ascending=False) #기본적으로 오름차순이지만 내림차순으로 정렬가능

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [152]:
obj = Series([4, 7, -3, 2])
obj.sort_values() #값에 따라 정렬하고 싶다

2   -3
3    2
0    4
1    7
dtype: int64

In [153]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values() # 기본적으로 비어있는 값들은 제일 마지막에 위치

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [154]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

DataFrame에서는 하나 이상의 칼럼에 있는 값으로 정렬이 필요할 수 있다. 이럴 때는 by 옵션에 필요한 칼럼의 이름을 넘기면 된다.

In [155]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [156]:
#여러 개의 칼럼을 정렬하려면 칼럼의 이름이 담긴 리스트를 전달하면 된다.
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [157]:
#왜이렇게 되는거야....????
obj = Series([7, -5, 7, 4, 2, 0, 4])
print(obj)
obj.rank()

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [158]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [159]:
obj.rank(ascending=False, method='max') #내림차순

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [160]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [161]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values
- 지금까지 살펴본 모든 예제는 모두 축의 이름(색인 값)이 유일했다.
- 앞으로는 index값이 중복된 Series객체를 살펴보자

In [162]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c']) #aa가 중복됨
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [163]:
obj.index.is_unique #해당 값이 유일한지 아닌지 알려준다

False

중복되는 색인 값이 있으면 Series 객체를 반환하고, 중복되는 값이 없으면 스칼라 값을 반환한다

In [164]:
obj['a']

a    0
a    1
dtype: int32

In [165]:
obj['c']

4

In [166]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [167]:
df.ix['b'] #index가 b인 값이 2개 이므로 객체를 반환

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics
- pandas의 수학, 통계 메서드는 처음부터 누락된 데이터를 제외하도록 설계되었다.

In [168]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [169]:
df.sum() # nan제외하고 값 반환

one    9.25
two   -5.80
dtype: float64

In [170]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [171]:
print(df.mean(axis=1))

print('\n 1.4/2')
print((7.1-4.5) /2)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

 1.4/2
1.2999999999999998

In [172]:
df.mean(axis=1, skipna=False) #False로 주면 na가 있으면 계산 NaN으로 반납

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [173]:
df.idxmax() # 최소 혹은 최대 값을 가지고 있는 색인 값 같은 간접 통계를 반환

one    b
two    d
dtype: object

In [174]:
df.cumsum() #누적

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [175]:
df.describe() #요약통계를 보여줌

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [176]:
import pandas as pd
obj = Series(['a', 'a', 'b', 'c'] * 4)
print(obj)
obj.describe()

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance
- pandas_datareader 패키지는 외부 확장 모듈로 
- conda install pandas-datareader 
- 명령으로 설치가능

In [177]:
import pandas as pd
from pandas_datareader import data

In [178]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker, 'yahoo', '2015-01-01', '2016-01-01')

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [179]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013059 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

corr 메서드는 NA가 아니고 정렬된 색인에서 연속하는 두 Series에 대해 상관관계를 계산하고 cov메서드는 공분산을 계산한다

In [180]:
returns.MSFT.corr(returns.IBM)

0.54925484798230662

In [181]:
returns.MSFT.cov(returns.IBM)

0.00013047520159136734

DataFrame 행렬상에서 상관관계와 공분산을 계산한다.

In [182]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.379946  0.516671  0.523573
GOOG  0.379946  1.000000  0.451687  0.520562
IBM   0.516671  0.451687  1.000000  0.549255
MSFT  0.523573  0.520562  0.549255  1.000000

In [183]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000119  0.000116  0.000157
GOOG  0.000119  0.000347  0.000112  0.000173
IBM   0.000116  0.000112  0.000178  0.000130
MSFT  0.000157  0.000173  0.000130  0.000317

In [184]:
returns.corrwith(returns.IBM) #다른 Series나 DataFrame과의 상관관계를 계산한다.

AAPL    0.516671
GOOG    0.451687
IBM     1.000000
MSFT    0.549255
dtype: float64

In [185]:
returns.corrwith(volume)
#여기서는 시가 총액의 퍼센트 변화율에 대한 상관관계를 계산해보았다.

AAPL   -0.119290
GOOG    0.405238
IBM    -0.297049
MSFT   -0.003517
dtype: float64

### Unique values, value counts, and membership

In [186]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [187]:
uniques = obj.unique() # 중복된 값을 제거하고 유일 값만 담고 있는 Series를 반환한다
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [188]:
obj.value_counts() #도수를 계산하여 반환한다

a    3
c    3
b    2
d    1
dtype: int64

- value_counts에서 반환하는 Series는 담고 있는 값으로 내림차순 정렬된다.
- value_counts 메서는 pandas이 최상위 메서드로, 어떤 배열이나 순차 자료 구조에서도 사용할 수 있다.

In [189]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [190]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

isin 메서드는 Series나 DataFrame의 칼럼에서 값을 골라내고 싶을 때 유용하게 사용할 수 있다.

In [191]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [192]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [193]:
result = data.apply(pd.value_counts).fillna(0) #
result
# 1이 Qu1에서는 1개 Qu2에서는 1개, Qu3에서는 1개 이런식으로 반환

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data
- pandas 설계 목표 중 하나는 누락 데이터를 가능한 한 쉽게 처리할 수 있도록 하는 것이다. 
- 예를 들어 앞에서 살펴봤듯이 pandas 객체의 모든 기술통계는 누락된 데이터를 배제하고 처리한다.

In [194]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [195]:
string_data.isnull() #널값 있는지 확인하고

0    False
1    False
2     True
3    False
dtype: bool

In [196]:
string_data[0] = None #파이썬의 내장None또한 NaN으로 처리
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data
- 누락된 데이터를 손으로 제거 해도 좋지만 dropna를 사요하는 것도 유용한 방법이다.

In [197]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [198]:
data[data.notnull()] #불리언 색인을 이용해서 직접 계산하는 것도 가능

0    1.0
2    3.5
4    7.0
dtype: float64

In [199]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [200]:
cleaned = data.dropna() #NA값이 하나라도 있는 row는 제외시킨다.
cleaned

     0    1    2
0  1.0  6.5  3.0

In [201]:
data.dropna(how='all') #모든값이 NA인 로우만 제외시킨다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [202]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [203]:
data.dropna(axis=1, how='all') # 모든 값이 nan인 row를 제거시킨다.
#보통 시계열 데이터에 사용되는 경향이 있다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [204]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [205]:
df.dropna(thresh=1) #thresh개 이상의 값이 들어있는 로우만 살펴보고 싶을 때

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [206]:
df.dropna(thresh=2)

          0         1         2
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data
- 누락된 값을 제외시키지 않고(잠재적으로 다른 데이터도 함께 버려질 가능성이 있다.) 데이터 상의 구멍을 어떻게든 메우고 싶은 경우가 있는데 이런 경우 fillna를 사용하면 된다.

In [207]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [208]:
df.fillna({1: 0.5, 2: -1}) #dic값으로 각 칼럼마다 다른 값을 채워 넣을 수도 있다.

          0         1         2
0 -0.577087  0.500000 -1.000000
1  0.523772  0.500000 -1.000000
2 -0.713544  0.500000 -1.000000
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [209]:
# fillna는 새로운 객체를 반환하지만 다음처럼 기존 객체를 변경할 수도 있다.
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [210]:
#재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용이 가능하다
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA
df.ix[4:, 2] = NA
df

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185       NaN       NaN
5  0.862580       NaN       NaN

In [211]:
df.fillna(method='ffill')

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185  1.349742 -1.549106
5  0.862580  1.349742 -1.549106

In [212]:
df.fillna(method='ffill', limit=2) #2개만 ffill을 적용해라 라는 뜻

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185       NaN -1.549106
5  0.862580       NaN -1.549106

In [213]:
#조금 더 창의적으로 생각해보면 fillna로 평균 값이나 중간 값을 전달할 수도 있다.
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing(계층적 색인)
- 계층적 색인은 pandas의 중요한 기능으로, 축에 대해 다중(둘 이상) 색인 단계를 지정할 수 있도록 해준다
- 차원이 높은 데이터를 낮은 차원의 형식으로 다룰 수 있게 해주는 기능이다.

In [214]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [215]:
data.index
#????????????????????????무슨뜻이지???????????????

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

### 계층적으로 색인된 객체는 데이터의 부분집합을 부분적 색인으로 접근하는 것이 가능하다.

In [216]:
data['b']

1   -0.023493
2   -2.304234
3   -0.652469
dtype: float64

In [217]:
data['b':'c']

b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
dtype: float64

In [218]:
data.ix[['b', 'd']]

b  1   -0.023493
   2   -2.304234
   3   -0.652469
d  2    1.074623
   3    0.723642
dtype: float64

In [219]:
data[:, 2]

a    0.852965
b   -2.304234
c   -1.332610
d    1.074623
dtype: float64

In [220]:
print(data)
data.unstack() #data를 재배열할수있다.

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

          1         2         3
a  0.670216  0.852965 -0.955869
b -0.023493 -2.304234 -0.652469
c -1.218302 -1.332610       NaN
d       NaN  1.074623  0.723642

In [221]:
data.unstack().stack() #stack 과 unstack 메서드는 7장에서 더 자세히 알아보기로하자.

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [254]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

- 만약 이름이 있다면 콘솔 출력 시에 함께 나타낟나
- 색인의 이름과 축의 라벨을 혼동하지 말자!

In [255]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [256]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [257]:
#MultiIndex는 따로 생성한 다음에 재사용이 가능하다
# 위에서 살펴본 DataFrame의 칼럼 계층의 이름은 다음처럼 생성할 수 있다.
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### Reordering and sorting levels
-계층 순서 바꾸고 정렬하기

In [259]:
frame.swaplevel('key1', 'key2') #key1와 key2가 뒤바뀐 새로운 객체를 반환한다. 하지만 데이터는 변경되지 않는다.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [260]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [261]:
frame.sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [262]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [228]:
frame.swaplevel(0, 1).sortlevel(0)
#sortlevel 메서드는 단일 계층에 속한 데이터를 정렬한다.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level(계층적 색인)
- D.F와 S는 많은 기술통계와 요약통계는 level 옵션을 가지고 있는데, 이는 어떤 한 축에 대해 합을 구하고 싶은 단계를 지정할 수 있는 옵션이다.

In [229]:
frame.sum(level='key2') # key2에 대한 합

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [230]:
frame.sum(level='color', axis=1) # color에 대한 합 요약

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns
- D.F 에서 로우를 선택하기 위한 색인으로 하나 이상의 칼럼을 사용하는 것은 두물지 않은 일이다. 아니면 로우의 색인을 DataFrame의 칼럼으로 옮기고 싶을 것이다.

In [231]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame
#여기서  c, d열을 index로... 하고싶다면??

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [232]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [233]:
#위에처럼 해버리면 c,d가 index되면서 열에서 사라지는데 False로 해주면 사라지지 않는다.
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [234]:
# reset_index 함수는 set_index와 반대되는 개념으로, 계층적 색인 단계가 컬럼으로 이동한다.
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [263]:
ser = Series(np.arange(3.))
print(ser)
ser[1]
ser[-1] #끝에서 첫번째를 말하는게 아닌것같다...
#오류

# 정수 index의 오류에 대한 대비책을 세우기 쉽지 않다.

0    0.0
1    1.0
2    2.0
dtype: float64

KeyError: -1

In [236]:
ser = Series(np.arange(3.))
print(ser)
ser.iloc[-1] #이렇게해야 index를 찾아서 불러오기 가능..

0    0.0
1    1.0
2    2.0
dtype: float64

2.0

In [237]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

반면, 정수 색인이 아니라면 그리 어렵지는 않다.

In [238]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

일관성을 유지하기 위해 색인 값을 가진 축 색인이 있을 경우, 정수 데이터는 항상 이름을 지향한다.
이는 ix 슬라이스에도 마찬가지로 적용된다.

# ? 무슨소리야

In [239]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

색인의 종류에 상관없이 위치 기반의 색인이 필요하다면 Series의 iget_value 메서드와 DataFrame의 irow, icol메서드를 사용하면된다.

In [240]:
ser3 = Series(range(3), index=[-5, 1, 3])
print(ser3)
ser3.iloc[2] #3번째 값

-5    0
 1    1
 3    2
dtype: int32

2

In [241]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [242]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

---

### Panel data
- Panel이라고 하는 자료구조는 DataFrame의 3차원 버전이라고 이해하면 된다.
- Panel은 DataFrmae 객체를 담고 있는 사전이나 3차원 ndarray를 통해 생성할 수 있다.
- 스프레트 시트 형식의 데이터를 다루는 데 초점을 맞추고 있고 계층적 색인을 이용하면 대개의 경우 N차원 배열은 불필요하다...

In [274]:
from pandas_datareader import data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

panel의 각 항목(dataFrame 에서 칼럼이라고 생각하면 된다)은 DataFrame이다.

In [244]:
pdata = pdata.swapaxes('items', 'minor')

In [275]:
pdata['Adj Close']

KeyError: 'Adj Close'

In [269]:
pdata.ix[:, '6/1/2012', :]

                   AAPL          DELL          GOOG          MSFT
Open       5.691600e+02  1.215000e+01  5.717910e+02  2.876000e+01
High       5.726500e+02  1.230000e+01  5.726510e+02  2.896000e+01
Low        5.605200e+02  1.204500e+01  5.683510e+02  2.844000e+01
Close      5.609900e+02  1.207000e+01  5.709810e+02  2.845000e+01
Volume     1.302469e+08  1.939760e+07  6.138700e+06  5.663430e+07
Adj Close  7.268161e+01  1.167592e+01  2.852053e+02  2.509345e+01

In [247]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   72.160786  14.58765  300.100412  26.248896
2012-05-23   73.921494  12.08221  304.426106  25.675584
2012-05-24   73.242607  12.04351  301.528978  25.640302
2012-05-25   72.850038  12.05319  295.470050  25.631482
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   74.143041  12.24666  296.873645  26.072491
2012-05-30   75.037005  12.14992  293.821674  25.878448
2012-05-31   74.850442  11.92743  290.140354  25.746145
2012-06-01   72.681610  11.67592  285.205295  25.093451
2012-06-04   73.109156  11.60821  289.006480  25.181652
2012-06-05   72.920005  11.76298  284.920579  25.146372
2012-06-06   74.038104  11.81619  289.995487  25.887268
2012-06-07   74.071787  11.73396  288.826666  25.781425
2012-06-08   75.185997  11.72429  289.935570  26.151873
2012-06-11   74.000526  11.47278  283.966519  25.490359
2012-06-12   74.647030  11.57919  282.268201  25.834347
2012-06-13   74.128794  11.87423  280.265216  25.693223
2012-06-14   74.047168  11.93711  279.246220  25.878448
2012-06-15   74.384024  11.89841  281.973510  26.478221
2012-06-18   75.893391  12.01449  285.140358  26.319457
2012-06-19   76.104579  11.78233  290.475012  27.077994
2012-06-20   75.888208  11.89841  288.467038  27.280858
2012-06-21   74.842665  11.60821  282.323161  26.584062
2012-06-22   75.416614  11.80168  285.455033  27.077994
2012-06-25   73.948707  11.55500  280.070407  26.345918
2012-06-26   74.111953  11.53565  282.058429  26.478221
2012-06-27   74.431960  11.92743  284.366112  26.610524
2012-06-28   73.725860  11.55984  281.873596  26.381198
2012-06-29   75.662780  12.10155  289.745749  26.980972
2012-07-02   76.766625  11.98064  289.945546  26.954511
...                ...       ...         ...        ...
2016-12-29  116.226096       NaN  782.789978  62.900002
2016-12-30  115.320020       NaN  771.820007  62.139999
2017-01-03  115.648597       NaN  786.140015  62.580002
2017-01-04  115.519154       NaN  786.900024  62.299999
2017-01-05  116.106611       NaN  794.020020  62.299999
2017-01-06  117.401002       NaN  806.150024  62.840000
2017-01-09  118.476334       NaN  806.650024  62.639999
2017-01-10  118.595819       NaN  804.789978  62.619999
2017-01-11  119.233055       NaN  807.909973  63.189999
2017-01-12  118.735214       NaN  806.359985  62.610001
2017-01-13  118.526121       NaN  807.880005  62.700001
2017-01-17  119.481976       NaN  804.609985  62.529999
2017-01-18  119.472017       NaN  806.070007  62.500000
2017-01-19  119.262925       NaN  802.174988  62.299999
2017-01-20  119.481976       NaN  805.020020  62.740002
2017-01-23  119.561633       NaN  819.309998  62.959999
2017-01-24  119.452107       NaN  823.869995  63.520000
2017-01-25  121.353858       NaN  835.669983  63.680000
2017-01-26  121.413604       NaN  832.150024  64.269997
2017-01-27  121.423555       NaN  823.309998  65.779999
2017-01-30  121.104937       NaN  802.320007  65.129997
2017-01-31  120.826147       NaN  796.789978  64.650002
2017-02-01  128.194203       NaN  795.695007  63.580002
2017-02-02  127.975152       NaN  798.530029  63.169998
2017-02-03  128.522781       NaN  801.489990  63.680000
2017-02-06  129.727549       NaN  801.340027  63.639999
2017-02-07  130.962201       NaN  806.969971  63.430000
2017-02-08  131.469994       NaN  808.380005  63.340000
2017-02-09  132.419998       NaN  809.559998  64.059998
2017-02-10  132.119995       NaN  813.669983  64.000000

[1203 rows x 4 columns]

통계 모델에 알맞게 Panel 데이터를 출력하는 다른 방법은 DataFrame을 쌓아 놓는 것이다.

In [248]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2017-01-30 AAPL   120.930000  121.629997  120.660004  121.629997   30377500.0
           GOOG   814.659973  815.840027  799.799988  802.320007    3228900.0
           MSFT    65.690002   65.790001   64.800003   65.129997   31601400.0
2017-01-31 AAPL   121.150002  121.389999  120.620003  121.349998   49201000.0
           GOOG   796.859985  801.250000  790.520020  796.789978    2143500.0
           MSFT    64.860001   65.150002   64.260002   64.650002   25104100.0
2017-02-01 AAPL   127.029999  130.490005  127.010002  128.750000  111985000.0
           GOOG   799.679993  801.190002  791.190002  795.695007    2023300.0
           MSFT    64.360001   64.620003   63.470001   63.580002   39410400.0
2017-02-02 AAPL   127.980003  129.389999  127.779999  128.529999   33710400.0
           GOOG   793.799988  802.700012  792.000000  798.530029    1525800.0
           MSFT    63.250000   63.410000   62.750000   63.169998   45664800.0
2017-02-03 AAPL   128.309998  129.190002  128.160004  129.080002   24507300.0
           GOOG   802.989990  806.000000  800.369995  801.489990    1460400.0
           MSFT    63.500000   63.700001   63.070000   63.680000   30065800.0
2017-02-06 AAPL   129.130005  130.500000  128.899994  130.289993   26845900.0
           GOOG   799.700012  801.669983  795.250000  801.340027    1174200.0
           MSFT    63.500000   63.650002   63.139999   63.639999   19503200.0
2017-02-07 AAPL   130.539993  132.089996  130.449997  131.529999   38183800.0
           GOOG   803.989990  810.500000  801.780029  806.969971    1235200.0
           MSFT    63.740002   63.779999   63.230000   63.430000   20233400.0
2017-02-08 AAPL   131.350006  132.220001  131.220001  132.039993   23004100.0
           GOOG   807.000000  811.840027  803.190002  808.380005    1155300.0
           MSFT    63.570000   63.810001   63.220001   63.340000   17884200.0
2017-02-09 AAPL   131.649994  132.449997  131.119995  132.419998   28349900.0
           GOOG   809.510010  810.659973  804.539978  809.559998     989700.0
           MSFT    63.520000   64.440002   63.320000   64.059998   22611900.0
2017-02-10 AAPL   132.460007  132.940002  132.050003  132.119995   19764500.0
           GOOG   811.700012  815.250000  809.780029  813.669983    1129100.0
           MSFT    64.250000   64.300003   63.980000   64.000000   17656800.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.037005
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.878448
2012-05-31 AAPL    74.850442
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.746145
2012-06-01 AAPL    72.681610
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.093451
2012-06-04 AAPL    73.109156
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.181652
2012-06-05 AAPL    72.920005
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.146372
2012-06-06 AAPL    74.038104
           DELL    11.816190
           GOOG   289.995487
           MSFT    25.887268
2012-06-07 AAPL    74.071787
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.781425
2012-06-08 AAPL    75.185997
           DELL    11.724290
...                      ...
2017-01-30 AAPL   121.104937
           GOOG   802.320007
           MSFT    65.129997
2017-01-31 AAPL   120.826147
           GOOG   796.789978
           MSFT    64.650002
2017-02-01 AAPL   128.194203
           GOOG   795.695007
           MSFT    63.580002
2017-02-02 AAPL   127.975152
           GOOG   798.530029
           MSFT    63.169998
2017-02-03 AAPL   128.522781
           GOOG   801.489990
           MSFT    63.680000
2017-02-06 AAPL   129.727549
           GOOG   801.340027
           MSFT    63.639999
2017-02-07 AAPL   130.962201
           GOOG   806.969971
           MSFT    63.430000
2017-02-08 AAPL   131.469994
           GOOG   808.380005
           MSFT    63.340000
2017-02-09 AAPL   132.419998
           GOOG   809.559998
           MSFT    64.059998
2017-02-10 AAPL   132.119995
           GOOG   813.669983
           MSFT    64.000000

[3922 rows x 6 columns]

DataFrame에는 to_panel 메서드와 그 반대인 to_frame 메서드가 있다.

In [249]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1197 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2017-02-10 00:00:00
Minor_axis axis: AAPL to MSFT

In [250]:
(1+3.5+7)/3

3.8333333333333335